# Ques-1

In [ ]:
import numpy as np
import pandas as pd

In [64]:
dataset= [10,12,12, 13,12,11,14,13,15,10,10, 10, 100,12, 14,13, 12,10, 10,11,12,15,12,13,12,11,14,13,15,10, 15,12,10,14,13,15,10]

In [66]:
len(dataset)

37

In [67]:
import numpy as np
import pandas as pd
outliers=[]
def detect_outlier(data_1):
    
    threshold=3
    mean_1 = np.mean(data_1)
    std_1 =np.std(data_1)
    
    
    for y in data_1:
        z_score= (y - mean_1)/std_1 
        if np.abs(z_score) > threshold:
            outliers.append(y)
    return outliers

In [68]:
outlier_datapoints = detect_outlier(dataset)
print(outlier_datapoints)

[100]

# Ques-2

In [ ]:
import numpy as np
import pandas as pd

In [42]:
# Q-2
def difference_date(df):
    # A list of all columns
    col_names=df.columns
    date=[]
    # itearate each column and try to convert the column into datetime using pd.to_datetime() 
    for i in col_names:
        if df[i].dtype=='object':
            try:
                df[i] = pd.to_datetime(df[i])
                date.append(i)
            except ValueError:
                continue
    return date

In [43]:
df=pd.read_csv(r'C:\Users\Anjali Kukreti\Desktop\python\all_data_copy.csv')
#difference_date(df)

In [44]:
# The above function does not work because we have some invalid formats in date column like Nan,Or,etc..
# So First we clean our dataset

In [45]:
# Find NAN
nan_df = df[df.isna().any(axis=1)]
display(nan_df.head())

dff = df.dropna(how='all')
dff.head()

     Order ID Product Quantity Ordered Price Each Order Date Purchase Address
1         NaN     NaN              NaN        NaN        NaN              NaN
356       NaN     NaN              NaN        NaN        NaN              NaN
735       NaN     NaN              NaN        NaN        NaN              NaN
1433      NaN     NaN              NaN        NaN        NaN              NaN
1553      NaN     NaN              NaN        NaN        NaN              NaN

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
2,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"
3,176560,Google Phone,1,600,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
4,176560,Wired Headphones,1,11.99,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
5,176561,Wired Headphones,1,11.99,04/30/19 09:27,"333 8th St, Los Angeles, CA 90001"

In [46]:
#difference_date(df)
# Now again I'm called my function it return nothing bcz in this dataframe there are some 
# other invalid formats

In [47]:
df[df['Order Date'].str[0:2]=='Or'].head(2)
# In Order Date some values are filled with Order Date

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
519,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
1149,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address

In [48]:
# So we drop rows which contains Order Date
dff=dff[dff['Order Date'].str[0:2]!='Or']

In [49]:
dff.dtypes

Order ID            object
Product             object
Quantity Ordered    object
Price Each          object
Order Date          object
Purchase Address    object
dtype: object

In [50]:
# difference_date(dff)
# It works fine here return column name "Order Date"
# But some rows contain hour and min 
# So we make a separate col for Date and time

In [51]:
def get_date(x):
    return x.split(" ")[0].strip()
dff['Date']=dff['Order Date'].apply(lambda x:f"{get_date(x)}")

In [52]:
date=difference_date(dff)

In [53]:
# So for this task I'm using Order Date and Date column 
# And perform Difference of these dates
def diff(date):
    for i in range(0,len(date),2):
        dff['Diff']=(dff[date[i]] - dff[date[i+1]]).dt.days

In [54]:
#date=['Order Date', 'Date']
diff(date)

In [55]:
dff.head(1)

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Date,Diff
0,176558,USB-C Charging Cable,2,11.95,2019-04-19 08:46:00,"917 1st St, Dallas, TX 75001",2019-04-19,0

In [56]:
# Difference is zero bcz we subtract same column

#  Ques-3

In [58]:
# Q-3
df=pd.read_csv(r'C:\Users\Anjali Kukreti\Desktop\python\StudentsPerformance.csv')

In [59]:
df.head(2)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88

In [60]:
def higly_corr(df,th):
    col_corr = [] # List of all the names of deleted columns
    corr_matrix = df.corr(method='pearson')
    print(corr_matrix)
    for i in range(len(corr_matrix.columns)):
        for j in range(i):
            if (corr_matrix.iloc[i, j] >= th) and (corr_matrix.columns[j] not in col_corr) and i!=j:
                colname = corr_matrix.columns[i] # getting the name of column
                col_corr.append(colname)
                if colname in df.columns:
                    del df[colname] # deleting the column from the dataset

    return df,col_corr

In [61]:
df,col_corr=higly_corr(df,0.85)

               math score  reading score  writing score
math score       1.000000       0.817580       0.802642
reading score    0.817580       1.000000       0.954598
writing score    0.802642       0.954598       1.000000

In [62]:
df.head(2)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score
0,female,group B,bachelor's degree,standard,none,72,72
1,female,group C,some college,standard,completed,69,90

In [63]:
print("Deleted Columns ")
for i in col_corr:
    print(i)

Deleted Columns
writing score

# End Tasks